InformationRegisters/Итоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Итоги</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗабито</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПропущено</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Квиз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Квиз</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КвизРезультаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>КвизРезультаты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Новости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Новости</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Туры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Туры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПодпискиНаСобытие/Ext/Module.bsl
Процедура ОбъектПередЗаписью(Источник, Отказ) Экспорт
	Если Отказ Тогда
		//
	ИначеЕсли Источник.ОбменДанными.Загрузка Тогда
		//
	ИначеЕсли Источник.Модифицированность() Тогда
		Исправитель	= Новый Структура("Наименование,Комментарий", "", "");
		ЗаполнитьЗначенияСвойств(Исправитель, Источник);
		Исправитель.Наименование	= СокрЛП(Исправитель.Наименование);
		Исправитель.Комментарий		= СокрЛП(Лев(Исправитель.Комментарий, 10000));
		ЗаполнитьЗначенияСвойств(Источник, Исправитель);
	КонецЕсли;
КонецПроцедуры

Процедура ОбъектПриКопировании(Источник, ОбъектКопирования) Экспорт
	ЗаполнитьЗначенияСвойств(Источник, Новый Структура("Комментарий,Изображение", ""));
КонецПроцедуры

Процедура СправочникПередУдалением(Источник, Отказ) Экспорт
	Если НЕ Источник.ПометкаУдаления Тогда
		Отказ = Истина;
	ИначеЕсли СерверныйФункции.ЕстьИстория(Источник.Ссылка) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если ЗначениеЗаполнено(Источник.Тур) Тогда
		Если Источник.ДополнительныеСвойства.Свойство("Импорт") = Ложь Тогда
			РегистрыСведений.Итоги.Обновить(Источник.Тур.Владелец);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	Если ЗначениеЗаполнено(Источник.Тур) Тогда
		РегистрыСведений.Итоги.Очистить(Источник.Тур.Владелец);
	КонецЕсли;
КонецПроцедуры

Процедура ИмпортИгр() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Туры.Владелец КАК Чемпионат,
	                      |	Туры.Ссылка КАК Тур,
	                      |	МАКСИМУМ(ЕСТЬNULL(ТурнирнаяТаблица.Период, Туры.ДатаОкончания)) КАК Период
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ПО Туры.Ссылка = ТурнирнаяТаблица.Тур
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
	                      |ГДЕ
	                      |	Туры.ПометкаУдаления = ЛОЖЬ
	                      |	И Туры.Владелец.ПометкаУдаления = ЛОЖЬ
	                      |	И Туры.Владелец.ДатаОкончания >= &ДатаН
	                      |	И Туры.Владелец.ДатаНачала <= &ДатаК
	                      |	И Туры.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Туры.Ссылка,
	                      |	Туры.Владелец
	                      |
	                      |ИМЕЮЩИЕ
	                      |	1 + 2 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) < КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧемпионатыКоманды.Команда) И
	                      |	МАКСИМУМ(ЕСТЬNULL(ТурнирнаяТаблица.Период, Туры.ДатаОкончания)) <= &ДатаК
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Чемпионат,
	                      |	Тур
	                      |ИТОГИ ПО
	                      |	Чемпионат");
	Запрос.УстановитьПараметр("ДатаН",			ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	Запрос.УстановитьПараметр("ДатаК",			ТекущаяДатаСеанса());
	Чемпионаты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Чемпионаты.Следующий() Цикл
		Выборка = Чемпионаты.Выбрать();
		КоличествоОшибок = 0;
		Пока Выборка.Следующий() И КоличествоОшибок < 3 Цикл
			Гиперссылка	= СерверныйФункции.ИмпортУРЛ(Выборка.Тур);
			Если НЕ СерверныйФункции.ИмпортИгрПоГиперссылке(Гиперссылка, Выборка.Тур) Тогда
				КоличествоОшибок = КоличествоОшибок + ?(Выборка.Период > ТекущаяДатаСеанса(), 3, 1);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Матч.Ссылка КАК Ссылка,
	               |	Матч.Дата КАК Период,
	               |	Матч.Комментарий КАК Комментарий
	               |ИЗ
	               |	Документ.Матч КАК Матч
	               |ГДЕ
	               |	Матч.Дата МЕЖДУ &ДатаН И &ДатаК
	               |	И Матч.Проведен = ЛОЖЬ
	               |	И Матч.ПометкаУдаления = ЛОЖЬ
	               |	И Матч.Комментарий ПОДОБНО ""http%""
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() И КоличествоОшибок <= 3 Цикл
		Гиперссылка	= СерверныйФункции.КомментарийКакУРЛ(Выборка.Комментарий);
		Если НЕ СерверныйФункции.ИмпортМатча(Гиперссылка, Выборка.Ссылка) Тогда
			КоличествоОшибок = КоличествоОшибок + ?(Выборка.Период > ТекущаяДатаСеанса(), 3, 1);
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоОшибок < 3 Тогда
		Слова = Разделить(СерверныйФункции.БуферНовостей(), Символы.ПС);
		Для Каждого Слово Из Слова Цикл
			ИмпортНовости(Слово);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция КвизУдалить(Параметры) Экспорт
	Попытка
		НЗ = РегистрыСведений.Квиз.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Параметры.Период);
		НЗ.Отбор.Сессия.Установить(Параметры.Сессия);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
		
		НЗ = РегистрыСведений.КвизРезультаты.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Параметры.Период);
		НЗ.Отбор.Сессия.Установить(Параметры.Сессия);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

Функция ЗначениеПолучить(ЧтениеXML, ЭтоДата=Ложь)
	Ответ	= "";
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Ответ = СокрЛП(ЧтениеXML.Значение);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЭтоДата Тогда
		Дата = Дата(1, 1, 1);
		Для Каждого ФорматДаты Из Разделить("ISO JavaScript Microsoft") Цикл
			Дата = СерверныйФункции.ПрочитатьДату(Ответ, ФорматДатыJSON[ФорматДаты]);
			Если ЗначениеЗаполнено(Дата) Тогда Прервать; КонецЕсли;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			СтрДень = "";	Месяц = 0;	СтрГод = "";
			Для Каждого Слово Из Разделить(СтрУдалить(Ответ, ",")) Цикл
				ЧислоИлиГод = СтрокаКакЧисло(Слово);
				Если ЗначениеЗаполнено(Дата) Тогда
					Прервать;
				ИначеЕсли ЧислоИлиГод > 2000 И ЧислоИлиГод <= Год(ТекущаяДатаСеанса()) Тогда
					СтрГод		= ФорматЧГ(ЧислоИлиГод);
				ИначеЕсли ЧислоИлиГод > 0 И ЧислоИлиГод <= 31 Тогда
					СтрДень	= Прав("0" + Слово, 2);
				ИначеЕсли Месяц = 0 Тогда
					Месяц	= СтрокаКакМесяц(Лев(Слово, 3));
				КонецЕсли;
				Если СтрГод > "2" И СтрДень > "0" И Месяц > 0 Тогда
					Дата = СтрокаКакДата(СтрШаблон("%1%2%3", СтрГод, Прав("00" + Формат(Месяц, "ЧГ=0"), 2), СтрДень));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Возврат Дата;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция Наполнитель()
	Возврат Новый Структура("Дата,Наименование,Комментарий,УРЛ");
КонецФункции

Функция НовостиСоздать(ДанныеЗаполнения)
	Ответ	= Ложь;
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Дата) Тогда
		Док		= Неопределено;
		Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		      	               |	Новости.Ссылка КАК Ссылка,
		      	               |	Новости.ПометкаУдаления КАК ПометкаУдаления,
		      	               |	Новости.Проведен КАК Проведен
		      	               |ИЗ
		      	               |	Документ.Новости КАК Новости
		      	               |ГДЕ
		      	               |	Новости.Дата МЕЖДУ &ДатаН И &ДатаК
		      	               |	И Новости.Комментарий ПОДОБНО &Комментарий
		      	               |
		      	               |УПОРЯДОЧИТЬ ПО
		      	               |	ПометкаУдаления УБЫВ,
		      	               |	Проведен УБЫВ");
		Запрос.УстановитьПараметр("ДатаН",			НачалоДня(ДанныеЗаполнения.Дата - Сутки(3)));
		Запрос.УстановитьПараметр("ДатаК",			КонецДня(ДанныеЗаполнения.Дата + Сутки()));
		Запрос.УстановитьПараметр("Комментарий",	Обернуть(ДанныеЗаполнения.УРЛ));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если НЕ Выборка.ПометкаУдаления И НЕ Выборка.Проведен Тогда
				Док = Выборка.Ссылка.ПолучитьОбъект();
			КонецЕсли;
		Иначе
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	Новости.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.Новости КАК Новости
			               |ГДЕ
			               |	Новости.ПометкаУдаления = ИСТИНА
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Новости.Дата";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Попытка
					Док	= Выборка.Ссылка.ПолучитьОбъект();
					Док.УстановитьПометкуУдаления(Ложь);
					ЗаполнитьЗначенияСвойств(Док, Новый Структура("Дата,Наименование,Комментарий"));
				Исключение
					Док		= Документы.Матч.СоздатьДокумент();
				КонецПопытки;
			Иначе
				Док = Документы.Новости.СоздатьДокумент();
			КонецЕсли;
		КонецЕсли;
		Если Док <> Неопределено Тогда
			Док.Заполнить(ДанныеЗаполнения);
			Если Док.ПроверитьЗаполнение() Тогда
				Попытка
					Док.Записать(РежимЗаписиДокумента.Запись);
					Ответ = Истина;
				Исключение
					ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, Док.Ссылка);
				КонецПопытки;
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ИмпортНовости(Гиперссылка) Экспорт
	Ответ	= 0;
	Если ЭтоУРЛ(Гиперссылка) Тогда
		Текст = СерверныйФункции.СкачатьПоСсылке(Гиперссылка);
	Иначе
		Текст = Гиперссылка;
	КонецЕсли;
	Если ПустаяСтрока(Текст) Тогда Возврат Ложь; КонецЕсли;

	ДанныеЗаполнения	= Наполнитель();
	ЧтениеXML	= Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Текст);
	ЧтениеXML.ПерейтиКСодержимому();
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
		И СтрСравнить(ЧтениеXML.Имя, "item") = 0
		Тогда
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Если СтрСравнить(ЧтениеXML.Имя, "item") = 0 Тогда
						Если НовостиСоздать(ДанныеЗаполнения) Тогда
							Ответ	= Ответ + 1;
						КонецЕсли;
						ДанныеЗаполнения	= Наполнитель();
						Прервать;
					КонецЕсли;
				ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					Если СтрСравнить(ЧтениеXML.Имя, "pubDate") = 0 Тогда
						ДанныеЗаполнения.Дата = ЗначениеПолучить(ЧтениеXML, Истина);
					ИначеЕсли СтрСравнить(ЧтениеXML.Имя, "title") = 0 Тогда
						ДанныеЗаполнения.Наименование= ЗначениеПолучить(ЧтениеXML);
					ИначеЕсли СтрСравнить(ЧтениеXML.Имя, "link") = 0 Тогда
						ДанныеЗаполнения.УРЛ	= ЗначениеПолучить(ЧтениеXML);
					ИначеЕсли СтрСравнить(ЧтениеXML.Имя, "description") = 0 Тогда
						Комментарий = ЗначениеПолучить(ЧтениеXML);
						ДанныеЗаполнения.Комментарий	= Комментарий;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента
		И СтрСравнить(ЧтениеXML.Имя, "item") = 0
		Тогда
			ДанныеЗаполнения	= Наполнитель();
		КонецЕсли;
	КонецЦикла;
	Если Ответ > 0 Тогда
		СерверныйФункции.Логировать("ПодпискиНаСобытие.ИмпортНовости", Ответ, Гиперссылка, УровеньЖурналаРегистрации.Информация);
	КонецЕсли;
	Возврат (Ответ > 0);
КонецФункции

Функция НовостиУдалить()
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	Новости.Ссылка КАК Ссылка,
	      	               |	Новости.ПометкаУдаления КАК ПометкаУдаления
	      	               |ИЗ
	      	               |	Документ.Новости КАК Новости
	      	               |ГДЕ
	      	               |	ВЫБОР
	      	               |			КОГДА Новости.Дата <= &ДатаК
	      	               |				ТОГДА Новости.ПометкаУдаления = ЛОЖЬ
	      	               |			КОГДА Новости.Дата <= &ДатаН
	      	               |				ТОГДА Новости.Проведен = ИСТИНА
	      	               |			ИНАЧЕ ЛОЖЬ
	      	               |		КОНЕЦ
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ПометкаУдаления");
	Запрос.УстановитьПараметр("ДатаН",			КонецДня(ТекущаяДатаСеанса() - Сутки(42)));
	Запрос.УстановитьПараметр("ДатаК",			КонецДня(ТекущаяДатаСеанса() - Сутки(99)));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() И НЕ Выборка.ПометкаУдаления Цикл
		Попытка
			Док	= Выборка.Ссылка.ПолучитьОбъект();
			Док.УстановитьПометкуУдаления(Истина);
		Исключение КонецПопытки;
	КонецЦикла;
КонецФункции
